{"title": "Uno Card Game", "short_description": "The classic card game of matching colours and numbers Special Action Cards and Wild Cards for unexpected excitement and game-changing fun Use the Swap Hands cards to change hands with any other opponent Write your own rules for game play with the Wild Customizable cards Players take turns matching a card in their hand with the current colour or number card shown on the top of the deck Don’t forget to shout UNO when you only have one card remaining Hands-on play for early childhood development \u009b See more product details", "product_description": "Product Description UNO is the classic card game of matching colours and numbers that is easy to pick up…impossible to put down and now comes with customizable Wild Cards for added excitement. Players take turns racing to get rid of all their cards by matching a card in their hand with the current card shown on top of the deck either by colour or number. Special Action cards deliver game-changing moments and help defeat opponents. Use the Swap Hands card to change hands with any other opponent and write your own rules using the 3 customizable (and erasable) Wild Cards. You’ll find 19 of each colour (red, green, blue and yellow), plus 8 Draw Two, Reverse and Skip cards in every colour, along with 4 Wild Cards, 4 Wild Draw Four cards, 1 Wild Swap Hands Card and 3 Wild Customizable cards. If you can’t make a match, you must draw from the central pile. Don’t forget to shout “UNO” when you only have one card remaining. The player to rid themselves of all the cards in their hand scores points for any cards their opponents are left holding. The first player to reach 500 points wins. Get Wild 4 UNO. Includes 112 cards and instructions. Each sold separately, subject to availability. colours and decorations may vary. Safety Warning N/A P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Box Contains 108 x Uno cards 1 x Instruction guide See more"}