{"title": "Asmodee Dobble Card Game", "short_description": "A game of speed, observation and reflexes Race to find the one matching image between one card and another Images may be different sizes and placed on any part of the card, making them difficult to spot Every card is different and has only one picture in common with every other card in the deck Five mini games: Fill the well, the towering inferno, hot potato, catch them all and the poisoned gift \u009b See more product details", "product_description": "Style Name: Dobble Product Description The Smash Hit Party Game Dobble is a speedy observation game where players race to match the identical symbol between cards. Reliant on a sharp eye and quick reflexes, Dobble creates excitement for children and adults alike while keeping every player involved in the action. Every card contains a matching symbol Award winning gameplay Addictive Fun for the Whole Family In Dobble, players compete with each other to find the matching symbol between one card and another. Every card is unique and has only one symbol in common with any other in the deck. The match can be difficult to spot as the size and positioning of the symbols can vary on each card. As the game is based on reactions and visual perception, rather than knowledge or strategy, there is no advantage for adults over children, making it the perfect family game. Take it Anywhere Suitable for ages 6+ and playable by 2-8 players, Dobble is simple to learn, quick to play but a challenge to master. Dobble's gameplay and its pocket sized tin make it the ideal party or travel game. 5 Different Ways to Play Dobble is a series of quickness-based mini-games in which all players play at the same time. You can play the mini-games in a specific order, randomly, or you can keep playing the same one over and over. The only important thing is to have fun! Objective of the Game No matter which game you play, you always need to be the fastest to spot the identical symbol between two cards, name it out loud and then take the card, place it or discard it depending on the rules of the mini-game you’re currently playing. Over 50 symbols Over 50 Symbols Dobble features 55 circular cards, each decorated with eight different symbols varying in size and orientation. With more than 50 symbols in total, gameplay is never dull. The Mini Games Fill the Well The Towering Inferno Hot Potato Catch Them All The Poisoned Gift Safety Warning N/A P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Box Contains 55 cards, 1 travel tin See more"}