{"title": "TOMY Pop Up Pirate Classic Children's Action Board Game, Family & Preschool Kids Game, Action Game for Children 4, 5, 6, 7, 8 Year Old Boys & Girls & Adults", "short_description": "WELCOME ABOARD ME HEARRRTIES! Pop-up Pirate is the classic action kids action game millions of children have played for generations and continue to enjoy to this day! GIVE NO QUARTER - Up to 4 players take turns to carefully slide their coloured swords into the barrel If you send Pirate Pete flying - you're out of the game! Last surviving pirate wins the game BECOME A SEADOG - This learning toy encourages decision- making in children and supports speech development as the little ones try and beat their friends and family ARRR' PIRATE! Pirate Pete will pop up on a different sword hole every time making this family action game unpredictably fun time and time again! ALL HANDS AHOY! Pop Up Pirate is a very enjoyable and fun family board game for children aged 4 - 10 as well as grown-ups as no one knows when Pirate Pete will pop up next! \u009b See more product details", "product_description": "Product Description B00000JICB Amazon.co.uk Review A well-loved classic game of nerve and chance, Pop-Up Pirate is barrels of explosive fun. To set the game up, there is a small amount of assembly to be done, with stickers to carefully stick on to decorate the barrel and base. Push the pirate down and he locks into the barrel in such a way that he will be popped up randomly when a sword is pushed in--and nobody knows which sword will be the one! Players select a set of swords of their favourite colour and take it in turns to choose a slot, hoping that they won't be the one to make the pirate pop up with a start. Once the pirate has been popped, the remaining players take out their swords and start to play again until only the winner is left. Every time you push the pirate back into the barrel, the hole which will make the him pop up changes, making Pop-Up Pirate a tense and exciting game in which you never know who is going to be the one to launch the pirate into space. -- Rachel Ediss 2 to 4 players. P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Safety Warning WARNING! CHOKING HAZARD- Small parts. Not for children under 4 years. Manufacturer's Description Swashbucklers beware! If the pirate pops up, ye be out! Pop-Up Pirate is loaded with fun! Twist the pirate into the barrel and take turns sliding your swords into the slots. Box Contains 1 x Barrel 1 x Barrel base 1 x Pirate 24 x Swords See more"}