{"title": "Fine Detail Brushes with Triangular Handles,10 Miniature Brush for Fine Detailing & Art Painting,Acrylic&Nail, Models,Watercolour, Miniatures,Oil, Wargaming Figures.", "short_description": "Easy grip handles:These fine detail paint brushes comes with the easy-grip triangular shape wooden handles which gives a comfortable and secure feel, and the seamless copper ferrules are double crimped and well attached to the wood and the brush hair, so there is no wiggling. Detail paint brush set: 10 different paint brushes in size 5/ 0, 3/ 0, 2/ 0, 0, 1, 2, 3, 4, 6, 8, packed in a plain plastic bag and held via elastic onto a piece of card Multiple use: these detail brushes are suitable for fine painting,miniature painting,40k models,oil, acrylic, watercolour, face painting, miniatures, detailing, craft art painting, etc. These Paint Brushes made out of soft nylon and work well for painting art. Brush nylon hair would do not stray or spread while painting. 100% SATISFACTION GUARANTEED -Golden maple prides itself on the high quality of its products - Customer satisfaction is very important to us, so contact us if you have any issues or are unhappy with the product and we will guarantee a resolution", "product_description": "Colour: 10pcs Detailing Brushes detail paint brushes set miniature artist paint brushes with triangular wooden handles for acrylic&nail,detailed work, Miniatures, Models,10 pieces Specifications Paint brush material: nylon hair with wooden handle Paint brush size: 5/ 0, 3/ 0, 2/ 0, 0, 1, 2, 3, 4, 6, 8 Paint brush length: 17.2 cm/ 6.8 inch to 19.5 cm/ 7.7 inch Color: black Easy grip handles These artist paint brushes comes with the easy-grip triangular shape wooden handles which gives a comfortable and secure feel, and the seamless copper ferrules are double crimped and well attached to the wood and the brush hair, so there is no wiggling. Flexible and firm hairs The paint brush tips are flexible and sturdy enough not to bend or split with pressure, they are neatly trimmed and shaped, no strands stick out, even after a few uses with acrylic paints and frequent cleaning. Features: Designed for easy grip and reasonable balance. 10 Different paint brushes in size 5/ 0, 3/ 0, 2/ 0, 0, 1, 2, 3, 4, 6, 8 Soft and polished wooden handles give you more control of the brush while painting. Detail brushes are suitable for oil, acrylic, watercolor, art painting, face painting, miniatures, etc. The seamless copper ferrules are double crimped and well attached to the wood and the brush hair, so there is no wiggling. Package includes: 10 x Detail paint brushes"}