{"title": "TOMY Toomies Hide and Squeak Eggs, Educational Shape Sorter Baby, Toddler & Kids Toy, Suitable For 6 Months & 1, 2 & 3 Year Old Boys & Girls ,Various,E1581", "short_description": "MORE THAN A HIDE & SEEK GAME - The popular toddler's educational toy comes with 6 different eggs and funny facial expressions. Crack them open to reveal 6 different colours that your little one can identify and match FUN SHAPE SORTER - This learning toy encourages shape sorting and colour recognition as it comes with 6 different shells to match with each egg and shapes that correspond with a unique carton spot PRESS AND LISTEN. Hide & Squeak eggs sensory toy will surely hold your toddler's attention as each chick chirps a happy cheep-cheep when pressed. Perfectly sized for little hands and fingers to play with. SUITABLE FOR BABIES, TODDLER & KIDS - This learning toy suits your baby needs as they grow. There isn't just one way to play - play hide & seek, shape sorting, colour matching and more. IDEAL GIFT FOR TODDLERS - Give the gift of fun learning for Easter, your baby's first Christmas or as a first birthday gift - you can't ever go wrong with these cheeky chicks. \u009b See more product details", "product_description": "Style Name: Hide 'n' Squeak Eggs Product Description Discover Hide & Squeak's six egg-stra special chicks, an amazing development toy that supports your baby's early education and cognitive skills while providing endless hours of playtime fun. Play Hide & Squeak by hiding the eggs around the house or garden and encourage your little one to press cheep-cheep once they find them... Help your toddler identify and name colours and match each shell with its egg... Make shape sorting fun and help them develop fine motor skills by having to place each egg on its unique carton spot... ...Or do it all at once! Hide and Squeak eggs are made of great quality and have been carefully designed for little hands to play and interact with. Great baby toy to encourage friends and family to play with the little ones while actively contributing to their early education. Safety Warning Suitable for children aged 6 months and over P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Box Contains 6 x Eggs with shells and chicks 1 x Egg container with shape holes See more"}