{"title": "Scrabble Orginal Y9592 Board Game", "short_description": "Scrabble is the classic word-forming game that always spells fun The object of the game is to earn the highest score by spelling words in crossword fashion onto the playing board, each player selects seven letter tiles at random to begin Scores are given for letter values and boosted by premium squares on the grid Scrabble game is not only fun but will improve your vocabulary as each time you play you are introduced to and exciting words Includes one scrabble game board, hundred letter tiles, four racks, a letter bag and instructions \u009b See more product details", "product_description": "Style Name: Original Product Description Scrabble is the classic board game that always spells fun. Consisting of interlocking words, crossword fashion, onto a playing board, scrabble game challenges players to spell out words using letter tiles with various score values. The object of the game is to get the highest score and scores are given for letter values and boosted by premium squares on the grid. Words can read either across or down and your word must use a letter tile already in play on the board. Each player competes by using their tiles in combinations and locations that take the best advantage of letter values and premium squares on the board. More than just a game, scrabble actually improves your vocabulary as you are introduced to new words each time you play. Includes one scrabble game board, 100 letter tiles, four racks, a letter bag and instructions. For two to four players, ages 10 and older. Colours and decorations may vary. Safety Warning NO_INFO_PIM P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Box Contains 1 x Playing board 4 x Letter racks 100 x Letter tiles 1 x Cotton tile bag 1 x Instruction sheet See more"}