{"title": "Roccat Kone AIMO Gaming Mouse (High Precision, Optical Owl-Eye Sensor (100 to 16.000 DPI), RGB Aimo LED Illumination, 23 Programmable Keys, Designed in Germany) Black(Remastered)", "short_description": "This fits your . Make sure this fits by entering your model number. P.when(\"ReplacementPartsBulletLoader\").execute(function(module){ module.initializeDPX(); }) 5 lighting Zones - featuring five Independently configurable lighting Zones, you can now customize your gaming aesthetic like never before; they also Synergize perfectly to allow for even smoother and more fluid lighting transitions Iconic Kone ergonomics - The legendary Kone shape has been tried and tested and is loved by Gamers the world over; close your eyes and place your hand atop it and you'll know it's unmistakably the Kone AIMO Evolutionary performance coating - grippy, durable and dirt-resistant thanks to a hybrid anti-wear coating; The performance finish helps you keep a firm hold of the Kone AIMO during even the most frantic of gaming sessions 24 button functions - Upgraded to include an improved thumb area, The Kone AIMO now boast additional versatility; the lowermost of the three thumb button defaults to Easy-Shift for an impressive total of 24 possible functions ROCCAT OWL-EYE sensor - experience unrelenting pointer precision with the all-new 16, 000DPI ROCCAT OWL-EYE Optical sensor; The sensor is adjustable in 1DPI increments and is characterized by exceptionally sharp accuracy and tracking capabilities", "product_description": "Style: Black The Kone has been Roccat's best-selling mouse since the very moment It launched in 2007. Continually refined through the years, it is adored by fans for its iconic shape and constant cutting-edge innovations. The Kone AIMO represents the latest heir to the Kone throne, remastered with an array of upgrades to make it better than ever before. Boasting the legendary ergonomics of its predecessors, it now features an improved thumb area for even more comfort and control. It is the ideal tool for every gaming job, with a full feature-set that provides maximum precision and command power in all situations."}