{"title": "Mega Bloks DCH55 Big Building Bag, Blue, 60 Pieces", "short_description": "​ 60 multi-coloured building blocks, including distinct shapes ​ Ideal for little hands ​ Hands-on play for early childhood development ​ Storage bag for easy clean up ​ Combine with other Mega Bloks preschool toys and build them up \u009b See more product details", "product_description": "Product Description Endless creativity with 60 award-winning building blocks. Build, stack and explore endless construction possibilities with this award-winning set of 60 building blocks in classic colours. Now your little one can build anything they imagine when they use the blocks and special shapes to create tall towers, crazy castles, funny animals, or whatever else they dream up. Perfect for little hands, these big blocks fit together and come apart easily, helping your child to develop fine motor skills and creativity over hours of open-ended play. When playtime's over, cleanup is easy with the handy storage bag. Ideal for ages 1 to 5 Safety Warning None P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Legal Disclaimer Non adatto a bambini sotto i 3 anni di etc. Nonostante sia nostro impegno assicurare la correttezza delle informazioni dei prodotti talvolta i produttori possono modificare le loro specifiche. L'imballaggio effettivo utilizzato e i materiali possono contenere informazioni che differiscono da quelle presentate nel nostro sito web. Si consiglia di non basarsi solo sulle informazioni qui presentate ma di leggere sempre le etichette, gli avvertimenti e i consigli d'uso prima di utilizzare o scartare un prodotto. Si suggerisce di contattare il produttore per avere maggiori informazioni su un determinato articolo. Box Contains 60 pieces See more"}