{"title": "Insect Lore Butterfly Garden (Packaging May Vary)", "short_description": "Raise Your Very Own Butterflies. Butterfly habitat is a reusable, cylindrical mesh container perfect for up close butterfly viewing Enjoy your butterflies for a few days, and then experience the excitement of letting them go to continue their amazing life cycle Redeem caterpillars with voucher from March - Mid-September Packaging may vary", "product_description": "Size: Pack of 1 | \n            \n             Colour: Green Product description Due to high demand you may need to order at least 1 month in advance for the caterpillars when you redeem the voucher online This educational kit gives children, students and families an unforgettable opportunity to watch caterpillars change into chrysalides and then emerge as beautiful Painted Lady Butterflies. Raise and feed your very own butterflies and then release them into the wild! The entire transformation from caterpillar to adult butterfly takes between 3 and 5 weeks to complete. Just redeem the unique code on the voucher included and Insect Lore will post your cup of 3-5 baby caterpillars out to you for a small fee of £2.99. Your caterpillars will arrive contained in a small cup along with all the food and nutrients they need.  Once grown they will transform into a chrysalis, when they have hardened, gently move them to the pop-up butterfly habitat. It will take about seven to ten more days for them to complete the transformation to adult butterflies.  Observe your beautiful Painted Ladies for up to 3 days before releasing them into nature so the cycle can continue. The Butterfly Garden Habitat is a reusable, cylindrical mesh container perfect for up close butterfly viewing! When not in use it folds flat for easy storage. The Live Butterfly Garden Includes: Pop-up, reusable 30cm tall mesh habitat perfect for butterfly viewing! Feeding Pipette Complete Instructions Voucher for 3-5 live caterpillars, £2.99 fee to pay upon redemption (caterpillars available March to Mid-September). Due to high demand you may need to order at least 1 month in advance for the caterpillars when you redeem the voucher online If you receive a USA certificate please send this into: Insect Lore, Unit 11 IQ Trade Estate, Warren Road, Indian Queens, TR9 6TL.  Postage and packing fee also applies to the USA certificate. Ag Safety Warning CHOKING HAZARD - Small parts - Not for Children under 3 years P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Box Contains Reusable, collapsible net for easy storage (30cm tall), feeding pipette, voucher for 5 Painted Lady caterpillars with food to be redeemed (p&p fee required), complete instructions for habitat. Please note that a small postage and packing fee of £2.99 is required to have your caterpillars sent at the time of redeeming your coupon. If you receive a USA certificate please send this into; Insect Lore, Unit 11 IQ Trade Estate, Warren Road, Indian Queens, TR9 6TL. Postage and packing fee also applies to the USA certificate. See more"}