{"title": "nonda USB C to USB Adapter,USB-C to USB 3.0 Adapter,Thunderbolt 3 to USB Female Adapter OTG for MacBook Pro 2019/2018,MacBook Air 2018,Surface Go,and More Type-C devices(Space Gray)", "short_description": "This fits your . Make sure this fits by entering your model number. P.when(\"ReplacementPartsBulletLoader\").execute(function(module){ module.initializeDPX(); }) [Usb 3. 0 SuperSpeed] Up to 5Gbps data transfer speed [Match MacBook] Unibody aluminum casing. 3 Colors to match Apple MacBook [Durable Aluminum Body] High quality components ensures longer life span [Wi-fi Interference Fixed] No Wi-Fi interference while using this upgraded adapter [1-Year Warrant_y] Feel free to upgrade to 3-Year warrant_y by registering to nonda USB-C adapter program", "product_description": "Color: Space Grey Product Description Introducing the world's smallest USB-C to USB-A adapter. Use it to charge up your phone and other standard USB devices or transfer data at USB 3.0 SuperSpeed (up to 5Gbps). Made out of durable aluminum alloy, the mini adapter comes in 3 colors to match the new MacBook 12-inch. It's also compatible with the Chromebook Pixel and other USB-C devices (OnePlus 3 incompatible). For optimal use, use the mini adapter with an uncovered laptop. If your MacBook is covered by a case, the mini adapter may not plug in properly. Do push the adapter hard to the end when you hear the click. Not for micro USB port or mini USB port. From the Manufacturer USB-C to USB A 3.0 Charge up your phone, iPad or any other standard USB device while you work and transfer data at USB 3.0 SuperSpeed (USB 3.1 Gen 1), which supports up to 5Gbps. The World's Smallest USB-C Adapter The mini adapter is made to be compact and highly portable, so that you can take it with you anywhere. Tuck it into your bag, pocket or wallet while you're on-the-go. Durable Aluminum Body Designed in Germany to be both sleek and highly functional. Made out of high quality aluminum alloy to be drop-shock resistant. Matches Your MacBook Available in 3 colors to match the Apple Macbook Pro 2016 and MacBook 12-inch. Works perfectly with original Apple cable Designed in just right width to work with Apple cable simultaneously. To create top quality smart devices that solves everyday problems. nonda is a smart hardware startup based in Palo Alto, California. We're a group of smart hardware enthusiasts, app developers, go-getters, and industry specialists. We love what we do and hope to share our vision of what the future of smart hardware will look like with the world. In 2016, two nonda products won the prestigious iF and Reddot Design Awards for best product design. About the Startup Describe your product in 3 words. Sleek. Portable. Durable. How did you come up with the idea for this product? When the MacBook 12-inch came out, we loved the concept of a super thin, highly portable working device. But we soon ran into a major problem. We couldn't connect our USB devices to our laptops as we used to, which disrupted our workflow. So we decided to tackle the problem head-on and came up with a solution that we're pretty proud of. What makes your product special? We designed the mini adapter to have the same elegant feel and quality as the Apple MacBook 12-inch. It's even constructed from the same aluminum alloy material. Because it's light and compact, the mini adapter provides a working solution that perfectly complements the MacBook's portability. What has been the best part of your startup experience? The best startup experience so far has been seeing customers rave about a product that we've spent months designing, prototyping and testing. It makes it all worthwhile. We get really pumped up by being able to make a difference in someone's day through our product experiences."}