{"title": "Duracell Rechargeable AA 2500 mAh Batteries Ideal for Xbox Controller, Pack of 4", "short_description": "This fits your . Make sure this fits by entering your model number. P.when(\"ReplacementPartsBulletLoader\").execute(function(module){ module.initializeDPX(); }) Duracell Rechargeable AA 2500 mAh batteries are its #1 longest-lasting per charge (for rechargeable AA size, per charge in same device) Duracell Rechargeable AA 2500 mAh batteries stay charged for up to 12 months, when not in use Unused Duracell Rechargeable AA 2500 mAh batteries are guaranteed to last 5 years Duracell Rechargeable AA 2500 mAh batteries come pre-charged, ready to use Duracell Rechargeable 2500 mAh AA batteries can be recharged 100's times Ideal for wireless video game controllers like Xbox controllers, baby toys, wireless electronics and more They are available in AA 2500 mAh, AAA 900 mAh, C 3000 mAh, D 3000 mAh and 9 V 170 mAh sizes and work in any NiMH charger", "product_description": "Size Name: Pack of 4 | \n            \n             Style Name: AA Ultra - 2500 mAh | \n            \n             Pattern Name: Single Product Description Duracell Rechargeable AA 2500 mAh batteries are its #1 longest-lasting per charge (for rechargeable AA size, per charge in same device) and let you charge 100's times. With a Long-Life Ion Core you get amazing power in every battery. Plus, they come pre-charged so you can power your devices right away and will stay charged for up to 12 months, when not in use. Additionally, unused Duracell Rechargeable AA 2500 mAh batteries are guaranteed to last 5 years. These powerful NiMH batteries work in any NiMH charger. With a longer-lasting charge and fewer recharges, Duracell Rechargeable AA 2500 mAh batteries really do set themselves apart from the rest. Ingredients Not Available P.when('A').execute(function(A) {\n                      A.on('a:expander:toggle_description:toggle:collapse', function(data) {\n                        window.scroll(0, data.expander.$expander[0].offsetTop-100);\n                      });\n                    }); Directions N/A Safety Warning Here are some useful tips which will help maximize your experience with Duracell batteries, and ensure safe usage: 1) When inserting batteries into your device, please take care to match the right polarities (+ and - ends) marked on the battery to the device; 2) Batteries which are incorrectly inserted into devices may be short-circuited. Do not charge regular Duracell batteries (only batteries marked Rechargeable). Please avoid mixing used with new batteries, or batteries of different brands. When replacing batteries in a device, replace them all because different levels of discharge & voltage could lead to venting / leakage. Fully used batteries should be immediately removed from devices and disposed of properly (as pertained by local laws). When discharged batteries are kept in your device for a long time, leakage may occur causing damage to the device. Avoid deforming or dismantling batteries in any way. Batteries contain various active ingredients which store electrochemical energy and can be dangerous if they contact your skin. Store unused batteries in their original packaging and away from metal objects. Mixing batteries with metal objects can cause the battery to short circuit and affect the battery performance. Do not throw away. Please follow local requirements to recycle electronic appliances and batteries. Legal Disclaimer If battery is not suitable it must be returned in Original packing unopened from Blister card Box Contains 1 x Duracell Recharge Ultra Type AA Batteries 2500 Mah - Pack of 4 See more"}